backend/app/models/maintenance_request.rb

SELECT "maintenance_requests".* FROM "maintenance_requests" ORDER BY "maintenance_requests"."ticket_number" DESC LIMIT $1  [["LIMIT", 1]]
---
  def generate_ticket_number
    last_ticket = MaintenanceRequest.order(ticket_number: :desc).first

SELECT "users".* FROM "users" INNER JOIN "user_properties" ON "user_properties"."user_id" = "users"."id" WHERE "users"."role" = $1 AND "user_properties"."property_id" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["role", "maintenance"], ["property_id", 8], ["LIMIT", 1]]
---
  def auto_assign_maintenance_user
    # Find first maintenance user for this property
    maintenance_user = User.joins(:user_properties)
                          .where(role: 'maintenance')
                          .where(user_properties: { property_id: property_id })
                          .first