backend/app/models/unit.rb

SELECT "leases".* FROM "leases" WHERE "leases"."unit_id" = $1 AND (move_out_date IS NULL OR move_out_date > $2) ORDER BY "leases"."id" ASC LIMIT $3  [["unit_id", 19], [nil, "2025-11-10"], ["LIMIT", 1]]
---
  def self.available
    # A unit is available if it has no active leases
    # Active lease = lease with move_out_date in the future or null
    left_joins(:leases)
      .where('leases.id IS NULL OR leases.move_out_date <= ?', Date.current)
      .distinct