backend/app/models/user.rb

SELECT 1 AS one FROM "properties" INNER JOIN "user_properties" ON "properties"."id" = "user_properties"."property_id" WHERE "user_properties"."user_id" = $1 AND "properties"."id" = $2 LIMIT $3  [["user_id", 20], ["id", 8], ["LIMIT", 1]]
---
  def can_access_property?(property_id)
    if super_admin?
      true
    elsif property_admin? || maintenance?
      properties.exists?(property_id)
    else
      # Residents can access if they have a lease for a unit in that property
      Property.joins(units: { leases: :lease_tenants })
              .where(id: property_id)
              .where(lease_tenants: { user_id: id })
              .exists?