backend/lib/tasks/fake_data.rake

SELECT 1 AS one FROM "properties" WHERE "properties"."name" IN ($1, $2) LIMIT $3  [["name", "The Meadows"], ["name", "Cassidy South"], ["LIMIT", 1]]
DELETE FROM "properties" WHERE "properties"."id" = $1  [["id", 1]]
DELETE FROM "units" WHERE "units"."id" = $1  [["id", 1]]
---
  task destroy: :environment do
    puts "🗑️  Destroying fake test data..."

    # Find and destroy the fake properties by name
    fake_properties = Property.where(name: ["The Meadows", "Cassidy South"])

    if fake_properties.empty?
      puts "ℹ️  No fake properties found to destroy"
      return
    end

    destroyed_units = 0
    destroyed_properties = 0

    fake_properties.each do |property|
      units_count = property.units.count
      destroyed_units += units_count
      property.destroy!