backend/lib/tasks/fake_data.rake

  task seed: :environment do
    puts "🌱 Seeding fake test data..."

    # Create The Meadows property
    meadows = Property.create!(
      name: "The Meadows",
      address: "123 Meadow Lane, Springfield, IL 62701",
      office_hours: "Monday-Friday: 9AM-6PM, Saturday: 10AM-4PM",
      pets_allowed: true,
      has_parking: true
    )

    # Create units for The Meadows
    meadows_units = [
      "Unit 101",
      "Unit 102",
      "Unit 103"
    ]

    meadows_units.each do |unit_name|
      unit = Unit.create!(
        property: meadows,
        name: unit_name
      )

      # Create pricing tiers for this unit (shorter terms = higher prices)
      UnitMonthlyPrice.create!([
        { unit: unit, term: "9 months", price: 1000.00 },
        { unit: unit, term: "12 months", price: 950.00 },
        { unit: unit, term: "24 months", price: 900.00 }
      ])
    end

    puts "✅ Created property: #{meadows.name} with #{meadows.units.count} units"

    # Create Cassidy South property
    cassidy = Property.create!(
      name: "Cassidy South",
      address: "456 South Street, Springfield, IL 62702",
      office_hours: "Monday-Friday: 8AM-7PM, Saturday: 9AM-5PM",
      pets_allowed: false,
      has_parking: true
    )
---
INSERT INTO "properties" ("name", "address", "office_hours", "pets_allowed", "has_parking", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "units" ("property_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["property_id", 1], ["name", "Unit 101"], ["created_at", "2025-10-15 20:08:11.390228"], ["updated_at", "2025-10-15 20:08:11.390228"]]
INSERT INTO "unit_monthly_prices" ("unit_id", "term", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["unit_id", 16], ["term", "9 months"], ["price", "1000.0"], ["created_at", "2025-10-17 09:18:37.048368"], ["updated_at", "2025-10-17 09:18:37.048368"]]
SELECT COUNT(*) FROM "units" WHERE "units"."property_id" = $1  [["property_id", 7]]

    ]

    cassidy_units.each do |unit_name|
      unit = Unit.create!(
        property: cassidy,
        name: unit_name
      )

      # Create pricing tiers for this unit (shorter terms = higher prices)
      UnitMonthlyPrice.create!([
        { unit: unit, term: "9 months", price: 1000.00 },
        { unit: unit, term: "12 months", price: 950.00 },
        { unit: unit, term: "24 months", price: 900.00 }
      ])
    end

    puts "✅ Created property: #{cassidy.name} with #{cassidy.units.count} units"

    total_properties = Property.count
    total_units = Unit.count
    total_prices = UnitMonthlyPrice.count
---
INSERT INTO "units" ("property_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["property_id", 8], ["name", "Unit 201"], ["created_at", "2025-10-17 09:18:37.086648"], ["updated_at", "2025-10-17 09:18:37.086648"]]
INSERT INTO "unit_monthly_prices" ("unit_id", "term", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["unit_id", 19], ["term", "9 months"], ["price", "1000.0"], ["created_at", "2025-10-17 09:18:37.100108"], ["updated_at", "2025-10-17 09:18:37.100108"]]
SELECT COUNT(*) FROM "units" WHERE "units"."property_id" = $1  [["property_id", 8]]
SELECT COUNT(*) FROM "properties"
SELECT COUNT(*) FROM "units"
SELECT COUNT(*) FROM "unit_monthly_prices"

  task destroy: :environment do
    puts "🗑️  Destroying fake test data..."

    # Find and destroy the fake properties by name
    fake_properties = Property.where(name: ["The Meadows", "Cassidy South"])

    if fake_properties.empty?
      puts "ℹ️  No fake properties found to destroy"
      return
    end

    destroyed_units = 0
    destroyed_properties = 0

    fake_properties.each do |property|
      units_count = property.units.count
      destroyed_units += units_count
      property.destroy!
---
SELECT "properties".* FROM "properties" WHERE "properties"."name" IN ($1, $2)  [["name", "The Meadows"], ["name", "Cassidy South"]]
SELECT 1 AS one FROM "properties" WHERE "properties"."name" IN ($1, $2) LIMIT $3  [["name", "The Meadows"], ["name", "Cassidy South"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "units" WHERE "units"."property_id" = $1  [["property_id", 3]]
DELETE FROM "properties" WHERE "properties"."id" = $1  [["id", 3]]
DELETE FROM "units" WHERE "units"."id" = $1  [["id", 6]]