backend/app/services/loyalty_tier_service.rb

SELECT "user_properties".* FROM "user_properties" WHERE "user_properties"."user_id" = $1 AND "user_properties"."property_id" = $2 LIMIT $3  [["user_id", 18], ["property_id", 8], ["LIMIT", 1]]
---
  def current_tier
    user_property = UserProperty.find_by(user: @user, property: @property)