backend/app/services/payment_calculation_service.rb

  def outstanding_payments
    return [] unless @monthly_rent

    today = Date.today
    outstanding = []

    # First payment is due the month AFTER move_in_date
    first_payment_month = (@lease.move_in_date.beginning_of_month + 1.month).beginning_of_month

    # Determine the last month we should check
    # If after 20th of current month, include next month
    last_month_to_check = if today.day > 20
      (today.beginning_of_month + 1.month).beginning_of_month
    else
      today.beginning_of_month
    end

    # Only check months if first payment month has been reached or passed
    return [] if first_payment_month > last_month_to_check

    # Get current tier and discount percentage
    current_tier = @loyalty_service.current_tier
    discount_percentage = @loyalty_service.discount_percentage

    # Iterate through each month from first payment month to last month to check
    current_month = first_payment_month
    while current_month <= last_month_to_check
      # Find or create payment for this month
      payment = @lease.payments.find_or_initialize_by(
        user: @user,
        payment_month: current_month
      )
---
SELECT "payments".* FROM "payments" WHERE "payments"."lease_id" = $1 AND "payments"."user_id" = $2 AND "payments"."payment_month" = $3 LIMIT $4  [["lease_id", 1], ["user_id", 18], ["payment_month", "2025-11-01"], ["LIMIT", 1]]