backend/app/controllers/api/v1/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "stevenking86@gmail.com"], ["LIMIT", 1]]
---
  def login
    user = User.find_by(email: params[:email])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def authenticate_user
    @current_user = User.find_by(id: session[:user_id])