backend/app/controllers/api/v1/leases_controller.rb

  def index
    # Get all leases for the current user through lease_tenants
    @leases = @current_user.leases.includes(:property, :unit, :rental_application)
    render json: @leases.map { |lease| lease_json(lease) }
---
SELECT "leases".* FROM "leases" INNER JOIN "lease_tenants" ON "leases"."id" = "lease_tenants"."lease_id" WHERE "lease_tenants"."user_id" = $1  [["user_id", 18]]

  def create
    @rental_application = @current_user.rental_applications.find_by(id: params[:rental_application_id])

    unless @rental_application
      render json: { error: 'Rental application not found' }, status: :not_found
      return
    end

    unless @rental_application.approved?
      render json: { error: 'Rental application must be approved to create a lease' }, status: :unprocessable_entity
      return
    end

    if @rental_application.lease.present?
      render json: { error: 'Lease already exists for this application' }, status: :unprocessable_entity
      return
    end

    @lease = Lease.new(
      rental_application: @rental_application,
      property: @rental_application.property,
      unit: @rental_application.unit,
      move_in_date: @rental_application.move_in_date,
      signed: true,
      signed_date: Date.today
    )

    if @lease.save
      # Create lease_tenant relationship
      LeaseTenant.create!(lease: @lease, user: @current_user)
---
SELECT "rental_applications".* FROM "rental_applications" WHERE "rental_applications"."user_id" = $1 AND "rental_applications"."id" = $2 LIMIT $3  [["user_id", 18], ["id", 2], ["LIMIT", 1]]
SELECT "leases".* FROM "leases" WHERE "leases"."rental_application_id" = $1 LIMIT $2  [["rental_application_id", 2], ["LIMIT", 1]]
INSERT INTO "leases" ("rental_application_id", "property_id", "unit_id", "signed", "signed_date", "move_in_date", "move_out_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "lease_tenants" ("lease_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["lease_id", 1], ["user_id", 18], ["created_at", "2025-11-19 12:01:32.367071"], ["updated_at", "2025-11-19 12:01:32.367071"]]