backend/app/controllers/api/v1/loyalty_controller.rb

SELECT "leases".* FROM "leases" INNER JOIN "lease_tenants" ON "leases"."id" = "lease_tenants"."lease_id" INNER JOIN "rental_applications" ON "rental_applications"."id" = "leases"."rental_application_id" WHERE "lease_tenants"."user_id" = $1 AND "rental_applications"."status" = $2 AND (leases.move_in_date <= $3) AND (leases.move_out_date IS NULL OR leases.move_out_date >= $4) ORDER BY "leases"."id" ASC LIMIT $5  [["user_id", 18], ["status", 1], [nil, "2025-11-21"], [nil, "2025-11-21"], ["LIMIT", 1]]
---
  def set_active_lease
    # Find active lease for the current user
    today = Date.today

    @active_lease = @current_user.leases.joins(:rental_application)
      .where(rental_applications: { status: :approved })
      .where('leases.move_in_date <= ?', today)
      .where('leases.move_out_date IS NULL OR leases.move_out_date >= ?', today)
      .first