backend/app/controllers/api/v1/maintenance_requests_controller.rb

  def index
    # Filter by role: residents see own, admins see accessible properties
    if @current_user.resident?
      @maintenance_requests = @current_user.maintenance_requests
                                          .includes(:property, :unit, :assigned_maintenance_user)
                                          .order(created_at: :desc)
    elsif @current_user.property_admin? || @current_user.maintenance? || @current_user.super_admin?
      property_ids = accessible_properties.pluck(:id)
      @maintenance_requests = MaintenanceRequest.where(property_id: property_ids)
                                                .includes(:property, :unit, :user, :assigned_maintenance_user)
                                                .order(created_at: :desc)
    else
      @maintenance_requests = []
    end

    render json: @maintenance_requests.map { |mr| maintenance_request_json(mr) }
---
SELECT "maintenance_requests".* FROM "maintenance_requests" WHERE "maintenance_requests"."property_id" = $1 ORDER BY "maintenance_requests"."created_at" DESC  [["property_id", 8]]
SELECT "properties"."id" FROM "properties" INNER JOIN "user_properties" ON "properties"."id" = "user_properties"."property_id" WHERE "user_properties"."user_id" = $1  [["user_id", 20]]
SELECT "properties".* FROM "properties" WHERE "properties"."id" = $1  [["id", 8]]
SELECT "units".* FROM "units" WHERE "units"."id" = $1  [["id", 20]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 18]]

  def maintenance_users
    # Get maintenance users for a specific property
    property_id = params[:property_id]

    unless @current_user.property_admin? || @current_user.super_admin?
      render json: { error: 'Property admin access required' }, status: :forbidden
      return
    end

    unless @current_user.can_access_property?(property_id.to_i)
      render json: { error: 'Access denied to this property' }, status: :forbidden
      return
    end

    maintenance_users = User.joins(:user_properties)
                           .where(role: 'maintenance')
                           .where(user_properties: { property_id: property_id })
                           .select(:id, :email)

    render json: maintenance_users.map { |u| { id: u.id, email: u.email } }
---
SELECT "users"."id", "users"."email" FROM "users" INNER JOIN "user_properties" ON "user_properties"."user_id" = "users"."id" WHERE "users"."role" = $1 AND "user_properties"."property_id" = $2  [["role", "maintenance"], ["property_id", 8]]

  def create
    # Only residents can create maintenance requests
    unless @current_user.resident?
      render json: { error: 'Only residents can create maintenance requests' }, status: :forbidden
      return
    end

    # Find property from user's active lease
    active_lease = @current_user.leases.joins(:rental_application)
                                 .where(rental_applications: { status: 'approved' })
                                 .where('leases.move_in_date <= ?', Date.today)
                                 .where('leases.move_out_date IS NULL OR leases.move_out_date >= ?', Date.today)
                                 .first

    unless active_lease
      render json: { error: 'No active lease found' }, status: :unprocessable_entity
      return
    end

    @maintenance_request = MaintenanceRequest.new(maintenance_request_params)
    @maintenance_request.user = @current_user
    @maintenance_request.property = active_lease.property
    @maintenance_request.unit = active_lease.unit

    if @maintenance_request.save
---
SELECT "leases".* FROM "leases" INNER JOIN "lease_tenants" ON "leases"."id" = "lease_tenants"."lease_id" INNER JOIN "rental_applications" ON "rental_applications"."id" = "leases"."rental_application_id" WHERE "lease_tenants"."user_id" = $1 AND "rental_applications"."status" = $2 AND (leases.move_in_date <= $3) AND (leases.move_out_date IS NULL OR leases.move_out_date >= $4) ORDER BY "leases"."id" ASC LIMIT $5  [["user_id", 18], ["status", 1], [nil, "2025-11-20"], [nil, "2025-11-20"], ["LIMIT", 1]]
UPDATE "maintenance_requests" SET "updated_at" = $1 WHERE "maintenance_requests"."id" = $2  [["updated_at", "2025-11-20 13:24:49.618794"], ["id", 1]]
INSERT INTO "maintenance_requests" ("ticket_number", "user_id", "property_id", "unit_id", "category", "description", "preferred_entry_time", "resident_must_be_home", "urgency_level", "status", "assigned_maintenance_user_id", "admin_notes", "resident_visible_notes", "resolution_notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"

  def update
    # Only property admins and super admins can update
    unless @current_user.property_admin? || @current_user.super_admin?
      render json: { error: 'Property admin access required' }, status: :forbidden
      return
    end

    # Check property access
    unless @current_user.can_access_property?(@maintenance_request.property_id)
      render json: { error: 'Access denied to this property' }, status: :forbidden
      return
    end

    if @maintenance_request.update(update_params)
---
UPDATE "maintenance_requests" SET "status" = $1, "updated_at" = $2 WHERE "maintenance_requests"."id" = $3  [["status", "Scheduled"], ["updated_at", "2025-11-20 13:30:01.665911"], ["id", 1]]

  def set_maintenance_request
    @maintenance_request = MaintenanceRequest.find(params[:id])
---
SELECT "maintenance_requests".* FROM "maintenance_requests" WHERE "maintenance_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]