backend/app/controllers/api/v1/payments_controller.rb

  def outstanding
    service = PaymentCalculationService.new(@active_lease, @current_user)
    outstanding_payments = service.outstanding_payments

    # Save any new payment records
    outstanding_payments.each { |payment| payment.save if payment.new_record? }
---
INSERT INTO "payments" ("user_id", "lease_id", "amount", "due_date", "paid_date", "status", "created_at", "updated_at", "payment_month", "stripe_payment_intent_id", "stripe_charge_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def create_intent
    service = PaymentCalculationService.new(@active_lease, @current_user)
    outstanding_payments = service.outstanding_payments

    if outstanding_payments.empty?
      render json: { error: 'No outstanding payments' }, status: :unprocessable_entity
      return
    end

    total_amount = service.total_amount_owed
    amount_in_cents = (total_amount * 100).to_i

    begin
      # Create Stripe Checkout Session
      frontend_url = ENV['FRONTEND_URL'] || 'http://localhost:3000'
      success_url = "#{frontend_url}/live/pay-rent?session_id={CHECKOUT_SESSION_ID}"
      cancel_url = "#{frontend_url}/live/pay-rent?canceled=true"

      session = Stripe::Checkout::Session.create(
        payment_method_types: ['card'],
        line_items: [{
          price_data: {
            currency: 'usd',
            product_data: {
              name: "Rent Payment - #{outstanding_payments.map { |p| p.payment_month.strftime('%B %Y') }.join(', ')}",
            },
            unit_amount: amount_in_cents,
          },
          quantity: 1,
        }],
        mode: 'payment',
        success_url: success_url,
        cancel_url: cancel_url,
        metadata: {
          user_id: @current_user.id,
          lease_id: @active_lease.id,
          payment_months: outstanding_payments.map { |p| p.payment_month.to_s }.join(',')
        }
      )
---
SELECT "payments".* FROM "payments" WHERE "payments"."lease_id" = $1 AND "payments"."user_id" = $2 AND "payments"."payment_month" = $3 LIMIT $4  [["lease_id", 1], ["user_id", 18], ["payment_month", "2025-11-01"], ["LIMIT", 1]]

      # Store session ID in outstanding payments (we'll use this to find them later)
      outstanding_payments.each do |payment|
        payment.stripe_payment_intent_id = session.id # Reusing this field for session ID
        payment.save if payment.persisted?
---
UPDATE "payments" SET "updated_at" = $1, "stripe_payment_intent_id" = $2 WHERE "payments"."id" = $3  [["updated_at", "2025-11-20 11:03:29.028863"], ["stripe_payment_intent_id", "cs_test_a10zkhbjK5a5xhrzYPqpYy6pGAZl6ktcQprwFajJderO2Ksejqh0mhR3pw"], ["id", 1]]

  def confirm
    session_id = params[:session_id]

    unless session_id
      render json: { error: 'Session ID is required' }, status: :unprocessable_entity
      return
    end

    begin
      # Retrieve the checkout session from Stripe
      session = Stripe::Checkout::Session.retrieve(session_id)

      # Verify it belongs to the current user
      unless session.metadata['user_id'].to_i == @current_user.id
        render json: { error: 'Unauthorized' }, status: :unauthorized
        return
      end

      # Find payments associated with this session
      payments = @active_lease.payments.where(stripe_payment_intent_id: session_id)

      if payments.empty?
        render json: { error: 'Payments not found' }, status: :not_found
        return
      end

      # Update payments if payment was successful
      if session.payment_status == 'paid'
        payments.each do |payment|
          payment.status = :paid
          payment.paid_date = Date.today
          payment.stripe_charge_id = session.payment_intent # Store payment intent ID from session
          payment.save
---
SELECT 1 AS one FROM "payments" WHERE "payments"."lease_id" = $1 AND "payments"."stripe_payment_intent_id" = $2 LIMIT $3  [["lease_id", 1], ["stripe_payment_intent_id", "cs_test_a10zkhbjK5a5xhrzYPqpYy6pGAZl6ktcQprwFajJderO2Ksejqh0mhR3pw"], ["LIMIT", 1]]
SELECT "payments".* FROM "payments" WHERE "payments"."lease_id" = $1 AND "payments"."stripe_payment_intent_id" = $2  [["lease_id", 1], ["stripe_payment_intent_id", "cs_test_a10zkhbjK5a5xhrzYPqpYy6pGAZl6ktcQprwFajJderO2Ksejqh0mhR3pw"]]
UPDATE "payments" SET "paid_date" = $1, "status" = $2, "updated_at" = $3, "stripe_charge_id" = $4 WHERE "payments"."id" = $5  [["paid_date", "2025-11-20"], ["status", 1], ["updated_at", "2025-11-20 11:04:14.094999"], ["stripe_charge_id", "pi_3SVVeo1XXhLTz4vr007wBBBm"], ["id", 1]]

  def set_active_lease
    # Find active lease for the current user
    today = Date.today

    @active_lease = @current_user.leases.joins(:rental_application)
      .where(rental_applications: { status: :approved })
      .where('leases.move_in_date <= ?', today)
      .where('leases.move_out_date IS NULL OR leases.move_out_date >= ?', today)
      .first
---
SELECT "leases".* FROM "leases" INNER JOIN "lease_tenants" ON "leases"."id" = "lease_tenants"."lease_id" INNER JOIN "rental_applications" ON "rental_applications"."id" = "leases"."rental_application_id" WHERE "lease_tenants"."user_id" = $1 AND "rental_applications"."status" = $2 AND (leases.move_in_date <= $3) AND (leases.move_out_date IS NULL OR leases.move_out_date >= $4) ORDER BY "leases"."id" ASC LIMIT $5  [["user_id", 18], ["status", 1], [nil, "2025-11-20"], [nil, "2025-11-20"], ["LIMIT", 1]]