backend/app/controllers/api/v1/rental_applications_controller.rb

  def index
    @rental_applications = @current_user.rental_applications.includes(:property, :unit, :lease)
    render json: @rental_applications.map { |app| rental_application_json(app) }
---
SELECT "leases".* FROM "leases" WHERE "leases"."rental_application_id" = $1  [["rental_application_id", 2]]
SELECT "rental_applications".* FROM "rental_applications" WHERE "rental_applications"."user_id" = $1  [["user_id", 18]]

  def create
    @rental_application = RentalApplication.new(rental_application_params)
    @rental_application.user = @current_user

    if @rental_application.save
---
INSERT INTO "rental_applications" ("user_id", "property_id", "unit_id", "move_in_date", "status", "created_at", "updated_at", "unit_monthly_price_id", "first_name", "last_name", "date_of_birth", "gender") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"