backend/app/controllers/api/v1/units_controller.rb

  def index
    @units = Unit.available.includes(:property)
    render json: @units.map { |unit| unit_json(unit) }
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" IN ($1, $2, $3, $4)  [["id", 3], ["id", 5], ["id", 6], ["id", 4]]
SELECT DISTINCT "units".* FROM "units" LEFT OUTER JOIN "leases" ON "leases"."unit_id" = "units"."id" WHERE (leases.id IS NULL OR leases.move_out_date <= $1)  [[nil, "2025-10-17"]]

  def show
    @unit = Unit.includes(:property, :unit_monthly_prices).find(params[:id])
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = $1  [["id", 8]]
SELECT "unit_monthly_prices".* FROM "unit_monthly_prices" WHERE "unit_monthly_prices"."unit_id" = $1  [["unit_id", 20]]
SELECT "units".* FROM "units" WHERE "units"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]

  def unit_json(unit)
    {
      id: unit.id,
      name: unit.name,
      property: {
        id: unit.property.id,
        name: unit.property.name,
        address: unit.property.address,
        office_hours: unit.property.office_hours,
        pets_allowed: unit.property.pets_allowed,
        has_parking: unit.property.has_parking
      },
      available: unit.available?,
      current_lease: unit.current_lease ? {
        id: unit.current_lease.id,
        move_in_date: unit.current_lease.move_in_date,
        move_out_date: unit.current_lease.move_out_date,
        signed: unit.current_lease.signed
      } : nil,
      unit_monthly_prices: unit.unit_monthly_prices.map { |ump| {
---
SELECT "unit_monthly_prices".* FROM "unit_monthly_prices" WHERE "unit_monthly_prices"."unit_id" = $1  [["unit_id", 19]]