backend/app/controllers/api/v1/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test User 2"], ["email", "test2@example.com"], ["created_at", "2025-10-15 14:28:18.162551"], ["updated_at", "2025-10-15 14:28:18.162551"], ["password_digest", nil]]