backend/app/controllers/api/v1/verifications_controller.rb

SELECT "verifications".* FROM "verifications" WHERE "verifications"."rental_application_id" = $1 AND "verifications"."user_id" = $2 LIMIT $3  [["rental_application_id", 1], ["user_id", 18], ["LIMIT", 1]]
INSERT INTO "verifications" ("rental_application_id", "user_id", "is_verified", "created_at", "updated_at", "id_name_first", "id_name_last", "id_valid", "name_match", "verification_status", "ai_response") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
UPDATE "verifications" SET "updated_at" = $1, "verification_status" = $2 WHERE "verifications"."id" = $3  [["updated_at", "2025-11-12 16:41:54.974175"], ["verification_status", "pending"], ["id", 2]]
---
  def create
    @verification = Verification.find_or_initialize_by(
      rental_application: @rental_application,
      user: @current_user
    )

    if params[:id_image]
      @verification.id_image.attach(params[:id_image])
      @verification.verification_status = 'pending'
      @verification.save

SELECT "verifications".* FROM "verifications" WHERE "verifications"."rental_application_id" = $1 AND "verifications"."user_id" = $2 LIMIT $3  [["rental_application_id", 2], ["user_id", 18], ["LIMIT", 1]]
---
  def show_by_application
    @verification = Verification.find_by(
      rental_application: @rental_application,
      user: @current_user
    )

SELECT "rental_applications".* FROM "rental_applications" WHERE "rental_applications"."id" = $1 AND "rental_applications"."user_id" = $2 LIMIT $3  [["id", 1], ["user_id", 18], ["LIMIT", 1]]
---
  def set_rental_application
    @rental_application = RentalApplication.find_by(
      id: params[:rental_application_id],
      user_id: @current_user.id
    )

SELECT "verifications".* FROM "verifications" WHERE "verifications"."id" = $1  [["id", 2]]
---
  def set_verification
    @verification = Verification.find_by(
      id: params[:id],
      user_id: @current_user.id
    )

UPDATE "verifications" SET "updated_at" = $1, "verification_status" = $2 WHERE "verifications"."id" = $3  [["updated_at", "2025-11-12 16:46:29.113924"], ["verification_status", "failed"], ["id", 2]]
UPDATE "verifications" SET "updated_at" = $1, "id_name_first" = $2, "id_name_last" = $3, "id_valid" = $4, "name_match" = $5, "verification_status" = $6, "ai_response" = $7, "id_name_middle" = $8 WHERE "verifications"."id" = $9
---
  def verify_id
    Rails.logger.info "[Verification Controller] Starting verification for verification_id: #{@verification.id}"
    Rails.logger.info "[Verification Controller] Rental Application ID: #{@rental_application.id}"

    service = IdVerificationService.new(@verification)
    result = service.verify

    if result[:error]
      Rails.logger.error "[Verification Controller] Verification failed with error: #{result[:error]}"
      @verification.verification_status = 'failed'
      @verification.ai_response = result
      @verification.save
    else
      verification_passed = result[:id_valid] && result[:name_match]
      Rails.logger.info "[Verification Controller] Verification result: #{verification_passed ? 'PASSED' : 'FAILED'}"
      Rails.logger.info "[Verification Controller] ID Valid: #{result[:id_valid]}, Name Match: #{result[:name_match]}"

      @verification.update(
        id_name_first: result[:id_name_first],
        id_name_middle: result[:id_name_middle],
        id_name_last: result[:id_name_last],
        id_valid: result[:id_valid],
        name_match: result[:name_match],
        verification_status: verification_passed ? 'verified' : 'failed',
        ai_response: result
      )